todo32/app/controllers/games_controller.rb

INSERT INTO "games" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Thu, 09 Jan 2014 14:08:46 UTC +00:00], ["name", nil], ["updated_at", Thu, 09 Jan 2014 14:08:46 UTC +00:00]]
---
  def create
    @game = Game.new(params[:game])
    if @game.save

SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "games" WHERE "games"."id" = ?  [["id", 1]]
---
  def destroy
    @game = Game.find(params[:id])
    @game.delete